[
  {
    "title": "30 Minute Teriyaki Chicken with Sesame Ginger Broccoli.",
    "ingredients": [
      "1/2 cup low sodium soy sauce",
      "1/3 cup honey",
      "2 tablespoons fresh grated ginger",
      "2 cloves garlic, minced or grated",
      "1 fresno chile pepper, seeded and diced",
      "1/4 cup sesame oil",
      "1 pound chicken breast or thighs",
      "1/2 pineapple, cut into half moons",
      "2 bunches broccoli or broccolini, cut into florets",
      "2 tablespoons sesame seeds",
      "kosher salt and pepper",
      "lime wedges, cilantro, and rice, for serving"
    ],
    "directions": [
      "Preheat the oven to 425 degrees F.",
      "To make the teriyaki sauce. In a small bowl, whisk together the soy sauce, honey, 1 tablespoon of the ginger, garlic, and fresno pepper.",
      "Heat a large, oven safe skillet over medium high heat. Add 2 tablespoons oil. When the oil shimmers, add the chicken and sear on both sides until lightly golden, about 2-3 minutes. Add the sauce and bring to a boil. Cook for 2-3 minutes or until the sauce thickens slightly. Remove from heat and add the pineapple.",
      "Toss the broccoli with the remaining 2 tablespoons oil, remaining 1 tablespoon ginger, sesame seeds, salt and pepper. If your skillet is large enough, add the broccoli to the skillet with the chicken, if not, add to a roasting pan. Transfer both the chicken and broccoli to the oven and cook for 15-20 minutes or until the chicken is cooked through and the broccoli lightly charred.",
      "Serve the chicken, pineapple and broccoli over a bed of rice with limes and cilantro. Enjoy!"
    ],
    "url": "https://recipeswithoutblogs.netlify.app/30-minute-teriyaki-chicken-with-sesame-ginger-broccoli/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Recipe: 30-Minute Sheet Pan Potatoes and Chicken Sausage | Kitchn",
    "ingredients": [
      "1 1/2 pounds baby red potatoes (about 2 inches in diameter),",
      "3 tablespoons olive oil,",
      "1 clove garlic, minced,",
      "Salt and freshly ground black pepper,",
      "2 tablespoons grated Parmesan cheese,",
      "12 to 16 ounces cooked chicken sausages, such as chicken apple, cut into 2-inch pieces,",
      "1 tablespoon coarsely chopped fresh parsley (optional)"
    ],
    "directions": [
      "Heat the oven to 450°F. Meanwhile, boil the potatoes.",
      "Place the potatoes in a medium saucepan, season generously with salt, and add enough water to cover the potatoes by about 1 inch. Bring to a boil over high heat, then reduce the heat to medium-low and simmer uncovered until the potatoes are cooked through, 12 to 15 minutes. Drain the potatoes and set aside to cool slightly. (The potatoes can be boiled and stored in the refrigerator up to 2 days ahead.)",
      "Place the potatoes on one half of a rimmed baking sheet. Using the palm of your hand, press down on each potato to smash to a uniform thickness of about 1/2 inch (the potatoes will split open and the flesh might crumble slightly).",
      "Mix the oil and garlic in a small bowl. Brush half of the oil mixture onto the potatoes and season with salt and pepper. Using a flat spatula, flip the potatoes over, brush with the remaining oil mixture, and season with salt and pepper.",
      "Roast until the bottoms of the potatoes are browned, 15 to 20 minutes. Using the flat spatula, flip the potatoes and sprinkle with the cheese. Place the sausages on the other side of the baking sheet. Roast until the edges and tops of the potatoes are golden-brown, 15 to 20 minutes more. Sprinkle the potatoes with the parsley, if using, and serve."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/30-min-sheet-pan-potatoes-and-chicken-sausage/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Aglio E Olio with Peas and Prosciutto",
    "ingredients": [
      "Kosher salt",
      "1/2 cup olive oil plus more for serving, optional",
      "4 ounces thinly sliced prosciutto cut across into 1/4-inch slices",
      "6 cloves garlic smashed and peeled",
      "1 1/2 cups frozen peas thawed",
      "3/4 teaspoon crushed red pepper flakes",
      "1 pound fusilli lunghi or cavatappi pasta",
      "2 cups freshly grated Parmigiano-Reggiano plus more for serving"
    ],
    "directions": [
      "Bring a large pot of salted water to a boil.",
      "Heat a large skillet over medium-high heat. Add the oil and heat.",
      "Add the chopped prosciutto and cook, stirring constantly, until crispy and deep golden brown, about 4 minutes.",
      "Using a slotted spoon, remove the prosciutto to a paper towel-lined plate.",
      "Reduce the heat to low.",
      "Add the garlic to the oil and cook, stirring often, until lightly golden, about 3 minutes.",
      "Add the peas, pepper flakes and 1/8 teaspoon salt and turn off the heat.",
      "Add the pasta to the boiling salted water and cook for 2 minutes less than package directions, about 9 minutes.",
      "Return the skillet with the garlic oil to medium heat. Using tongs, remove the pasta from the water and add directly to the skillet with the oil.",
      "Sprinkle the bare pasta with 1 cup Parmigiano-Reggiano.",
      "Add 1/2 cup pasta water and toss well to coat the pasta and form a creamy sauce.",
      "Add the remaining 1 cup Parmigiano-Reggiano and up to 1/2 cup more pasta water to maintain a creamy sauce.",
      "Serve sprinkled with the crispy prosciutto, more Parmigiano-Reggiano and another drizzle of olive oil, if desired."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/aglio-e-olio/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Antipasto Mozzarella Sandwich with Lemon Pesto",
    "ingredients": [
      "1 loaf ciabatta bread, halved lengthwise",
      "1/2 cup basil pesto (recipe follows)",
      "6 slices spicy salami",
      "6 slices prosciutto",
      "1 cup marinated artichokes, drained and quartered",
      "1 roasted red pepper, sliced",
      "1/2 cup oil packed sun-dried tomatoes, oil drained and chopped",
      "8 ounces fresh burrata or mozzarella",
      "4 ounces provolone, sliced",
      "1 cup baby arugula",
      "2 cups fresh basil",
      "1/4 tablespoons toasted pine nuts, walnuts, pistachios, or pumpkin seeds",
      "1 jalapeño, seeded, if desired",
      "1/2 cup grated parmesan cheese",
      "1/3 cup extra virgin olive oil",
      "zest and juice of 1 lemon",
      "kosher salt",
      "2 cloves garlic, smashed"
    ],
    "directions": [
      "Lay the bread cut side up on a clean work surface. Working with the top piece of the loaf, pull out some of the insides to create a space for the filling. Spread both cut sides of bread with pesto.",
      "Working with the bottom piece of bread, layer on the salami, prosciutto, artichokes, red peppers, and sun-dried tomatoes. Tear the burrata and layer evenly over the veggies. Add the provolone. Sprinkle the arugula over top. Add the top half of the ciabatta and gently push down on the sandwich.",
      "Wrap the sandwich tightly in plastic wrap and place in the fridge for 1 hour or up to 1 day. Before serving, cut into 4-6 sandwiches.",
      "Alternately, you can warm the sandwich in a 350 degree oven for 15 minutes or until the cheese is melted. This is really good.",
      "In a blender or food processor, combine all ingredients and pulse until finely chopped. Taste and add salt as needed. Keep stored in the fridge for up to 2 weeks."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/antipasto-mozzarella-sandwich-with-lemon-pesto/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Asian Sriracha Chicken",
    "ingredients": [
      "6 tbsp olive oil",
      "4 1/2 tbsp Sriracha",
      "4 tbsp sesame oil",
      "6 tbsp soy sauce",
      "3 tbsp honey",
      "1 tsp red chili flakes",
      "3 inches ginger peeled & grated",
      "8-9 cloves garlic, minced",
      "1/2 tsp Chinese five spice",
      "2 1/2 lbs chicken thighs",
      "1/2 cup chicken broth"
    ],
    "directions": [
      "Tenderize chicken with mallet",
      "Set aside pounded chicken in glass bowl",
      "In a medium size bowl, whisk oils, soy sauce, honey, sriracha, ginger, garlic, chili pepper flakes, and Chinese five spice",
      "Marinade chicken in refrigerator for 1-2 hours",
      "Heat grill on medium-high. Grill chicken 10-12 minutes until charred and cooked through",
      "While meat is grilling, in a separate saucepan, add marinade and chicken broth. bring to a rolling boil for 2 minutes, consistently stirring. Set aside.",
      "Once chicken is cooked, let it rest for 5 minutes. Cut into strips",
      "Serve over rice with any garnish or sides. Top with marinade"
    ],
    "url": "https://recipeswithoutblogs.netlify.app/asian-sriracha-chicken/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Bourbon Cherry Old Fashioned",
    "ingredients": [
      "4-6 fresh cherries, pitted",
      "juice from half a lime",
      "dash of orange bitters",
      "1-2 tablespoons honey",
      "2 ounces bourbon, more or less to taste",
      "fresh mint and cherries for garnish"
    ],
    "directions": [
      "Muddle the cherries, lime juice, orange bitters, and honey in a cocktail shaker or glass jar until the cherries are well mashed and have released their juices. Add the bourbon and shake to combine.",
      "Strain (or not, I leave my cherries in!) into a cocktail glass filled with ice. If desired top with sparking water. Garnish with mint and cherries. DRINK! ?"
    ],
    "url": "https://recipeswithoutblogs.netlify.app/bourbon-cherry-old-fashioned/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Broccoli Cheddar Soup",
    "ingredients": [
      "1 tablespoon + 4 tablespoons unsalted butter, divided",
      "1 small or medium sweet yellow onion, diced small",
      "1 clove garlic, peeled and minced finely",
      "1/4 cup all-purpose flour",
      "2 cups low-sodium vegetable stock (chicken stock may be substituted)",
      "2 cups half-and-half*",
      "2 to 3 cups broccoli florets, diced into bite-size pieces + 1 cups stems, optional (I used 3 cups florets and 1 cup stems",
      "2 large carrots, trimmed, peeled, and sliced into very thin rounds, about 1/16th-inch",
      "3/4 teaspoon salt, or to taste",
      "3/4 teaspoon freshly ground black pepper, or to taste",
      "1/2 teaspoon smoked paprika or regular paprika, optional and to taste",
      "1/2 teaspoon dry mustard powder, optional and to taste",
      "pinch cayenne pepper, optional and to taste (doesn’t make soup spicy and serves to enhance flavor)",
      "8 ounces grated high quality extra-sharp cheddar cheese, with a small amount reserved for garnishing"
    ],
    "directions": [
      "In a small saucepan, add 1 tablespoon butter, the diced onion, and sauté over medium heat until the onion is translucent and barely browned, about 4 minutes. Stir intermittently.",
      "Add the garlic and cook about 30 seconds, stirring constantly so it doesn’t burn. Remove from heat and set pan aside.",
      "In a large heavy-bottom pot (I use this Le Creuset Signature Enameled Cast-Iron 6-3/4-Quart Oval French (Dutch) Oven) add 4 tablespoons butter, flour, and cook over medium heat for about 3 to 5 minutes, whisking constantly, until flour is thickened. You are making a roux and it’s very important the mixture is thick or soup will never thicken properly later.",
      "Slowly add the vegetable stock, whisking constantly.",
      "Slowly add the half-and-half, whisking constantly.",
      "Allow mixture to simmer over low heat for about 15 to 20 minutes, or until it has reduced and thickened some. Whisk intermittently to re-incorporate the ‘skin’ that inevitably forms, this is normal.",
      "While mixture is simmering, chop the broccoli and carrots. After simmering 15 to 20 minutes, add the broccoli, carrots, and the onion and garlic you previously set aside.",
      "Add the salt, pepper, optional paprika, optional dry mustard powder, and optional cayenne. If you don’t have these seasonings on hand, it’s okay, but they do add subtle depth of flavor. 9. Stir to combine.",
      "Allow soup to simmer over low heat for about 20 to 25 minutes, or until it has reduced and thickened some. Whisk intermittently to re-incorporate the ‘skin’ that inevitably forms, this is normal.",
      "While soup simmers, grate the cheese. It’s important to use a high-quality cheese (not the cheapest thing you can find) because the flavor of the soup depends on it. Do not use pre-grated cheese in ziptop bags because that cheese is resistant to melting and won’t incorporate well. After simmering about 20 to 25 minutes, add most of the cheese, reserving a small amount for garnishing bowls. Stir in the cheese until melted and incorporated fully, less than 1 minute.",
      "Transfer soup to bowls, garnish with reserved cheese, and serve immediately. Soup will keep airtight for 5 to 7 days in the fridge. Reheat gently in the microwave. I find the soup is less likely to ‘break’ or separate when reheated in the micro rather than on the stovetop, but do what you think is best. I don’t recommend freezing the soup because I feel like the cheese and half-and-half will not do well upon thawing and soup could break, but I haven’t actually tried freezing it."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/broccoli-cheddar-soup/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Broccolini, Chicken Sausage, and Orzo Skillet | Kitchn",
    "ingredients": [
      "2 tablespoons olive oil",
      "8 ouncesfully cooked hot Italian chicken sausage, cut into 1/4-inch-thick rounds,",
      "2 bunches broccolini (about 1 pound), coarsely chopped,",
      "Kosher salt,",
      "Freshly ground black pepper,",
      "2 cloves garlic, minced,",
      "1 cup orzo pasta,",
      "2 1/2 cups low-sodium chicken broth,",
      "1/2 cup grated Parmesan, plus more for serving"
    ],
    "directions": [
      "Heat the oil in a 10-inch regular or cast iron skillet over medium-high heat. Add the sausage and cook until evenly browned on both sides, 3 to 4 minutes.",
      "Add the broccolini, season with salt and pepper, and sauté until vibrant green and almost tender, about 5 minutes.",
      "Add the garlic and orzo and sauté until fragrant, about 1 minute.",
      "Add the chicken broth and bring the mixture to a boil. C",
      "over, reduce to a simmer, and cook until the pasta is al dente and the liquid is absorbed, about 10 minutes or according to your orzo's package instructions. (If the pasta is cooked before the liquid is completely absorbed, uncover the skillet and let it simmer for an extra minute to evaporate it.)",
      "Stir in the 1/2 cup of Parmesan and season as needed with salt and pepper. Garnish with additional grated cheese if desired."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/broccolini-chicken-sausage-and-orzo-skillet/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "The Best-Ever California Sandwich | Kitchn",
    "ingredients": [],
    "directions": [
      "Thinly slice 1/2 English cucumber.",
      "Peel 4 medium carrots, then grate on the large holes of a box grater (about 2 cups).",
      "Thinly slice 2 tomatoes with a serrated knife.",
      "Halve and pit 2 avocados.",
      "Scoop the flesh into a medium bowl.",
      "Add 1 tablespoon lemon juice, 1 tablespoon olive oil, and 1/2 teaspoon kosher salt, and mash until the avocado is smooth.",
      "Toast 8 slices multigrain bread. Place 4 of the slices on a work surface and spread 2 tablespoons hummus on each.",
      "Top each with 2 slices provolone cheese.",
      "Divide 1 cup sprouts over the cheese. Divide the tomatoes, cucumbers, and carrots over the sprouts.",
      "Spread the mashed avocado onto the remaining 4 bread slices (about 3 tablespoons each).",
      "Place avocado-side down over the carrots to close the sandwiches.",
      "Cut each sandwich in half with a serrated knife and serve.",
      "This sandwich is best eaten soon after it is assembled."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/california-sandwich/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Carbonara-ish Stir-Fried Udon With Gochujang",
    "ingredients": [
      "1 tablespoon neutral oil",
      "2 slices of thick-cut bacon, sliced into 1/4-inch strips or lardons",
      "3 to 4 scallions, thinly sliced (reserve 1 tablespoon scallion greens for garnish)",
      "2 to 3 garlic cloves, minced or crushed",
      "2 egg yolks, at room temperature",
      "1/2 cup grated Parmesan cheese",
      "1 teaspoon soy sauce",
      "1 tablespoon gochujang",
      "2 blocks frozen udon noodles",
      "1/2 cup reserved udon cooking water (you will not be using this all)",
      "1/4 teaspoon toasted sesame oil",
      "1 pinch kosher salt (optional) and coarsely ground black pepper (not optional), plus more to taste"
    ],
    "directions": [
      "Bring a medium pot filled with water to boil for the udon.",
      "In a skillet, heat oil over medium-low heat. Add the bacon, scallions, garlic, and a pinch of salt. Let the bacon fat render slowly and saute all until golden brown, about 5 to 6 minutes. Monitor the heat and lower it if it browns too quickly.",
      "In the meantime, in a medium or large mixing bowl, add the egg yolks. Add the cheese, pinch of salt and coarsely ground pepper (at least 8 to 10 turns). It will look like a paste at this point, but the udon cooking water will loosen it up shortly. Set aside., Lower the skillet’s heat to low. Add the soy sauce and gochujang and \"fry\" in the bacon's oil. Coat the bacon mixture with the gochujang.",
      "Cook udon noodles according to package instructions (usually 45 to 60 seconds). They are already cooked, so you are just warming them through and gently releasing them from their caked state with tongs or chopsticks. It’s important not to overcook them. Reserve about ½ cup of udon cooking water. Drain in a colander and add the udon noodles to the pan (alternately, you can also use a spider strainer to lift up and drain the udon noodles from the pot and into the skillet—it’s okay to have a bit of the residual water clinging on). Toss until well-combined and udon noodles are coated in the gochujang-bacon sauce. Turn off the heat.",
      "To the mixing bowl with the egg-cheese mixture, add 2 to 3 tablespoons of the reserved udon cooking water and mix to form a slightly looser paste. Add the udon noodles and toss until well- combined (you can also add the egg-cheese mixture to the pan that’s off the heat, being careful not to curdle or scramble the eggs). Drizzle in a bit of sesame oil. Season with salt (optional) and pepper (not optional), to your taste. Give it another toss before plating. Top with reserved scallion greens and more coarsely ground pepper, if you’d like. Serve immediately."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/carbonara-ish-stir-fried-udon-with-gochujang/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Oven-Roasted Chicken Shawarma",
    "ingredients": [
      "2 lemons, juiced",
      "1/2 cup plus 1 tablespoon olive oil",
      "6 cloves garlic, peeled, smashed and minced",
      "1 teaspoon kosher salt",
      "2 teaspoons freshly ground black pepper",
      "2 teaspoons ground cumin",
      "2 teaspoons paprika",
      "½ teaspoon turmeric",
      "A pinch ground cinnamon",
      "Red pepper flakes, to taste",
      "2 pounds boneless, skinless chicken thighs",
      "1 large red onion, peeled and quartered",
      "2 tablespoons chopped fresh parsley"
    ],
    "directions": [
      "Prepare a marinade for the chicken. Combine the lemon juice, 1/2 cup olive oil, garlic, salt, pepper, cumin, paprika, turmeric, cinnamon and red pepper flakes in a large bowl, then whisk to combine. Add the chicken and toss well to coat. Cover and store in refrigerator for at least 1 hour and up to 12 hours.",
      "When ready to cook, heat oven to 425 degrees. Use the remaining tablespoon of olive oil to grease a rimmed sheet pan. Add the quartered onion to the chicken and marinade, and toss once to combine. Remove the chicken and onion from the marinade, and place on the pan, spreading everything evenly across it.",
      "Put the chicken in the oven and roast until it is browned, crisp at the edges and cooked through, about 30 to 40 minutes. Remove from the oven, allow to rest 2 minutes, then slice into bits. (To make the chicken even more crisp, set a large pan over high heat, add a tablespoon of olive oil to the pan, then the sliced chicken, and sauté until everything curls tight in the heat.) Scatter the parsley over the top and serve with tomatoes, cucumbers, pita, white sauce, hot sauce, olives, fried eggplant, feta, rice — really anything you desire."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/chicken-shawarma/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Chicken Stew With Potatoes, Carrots & Celery",
    "ingredients": [
      "3 tablespoons extra-virgin olive oil",
      "2 pounds skinless boneless chicken thighs",
      "1 medium white onion, finely chopped",
      "4 garlic cloves, finely chopped",
      "Kosher salt",
      "1 sprig rosemary",
      "1 sprig thyme",
      "3 medium carrots, peeled and cut into 1-inch pieces",
      "3 ribs celery, cut into 1-inch pieces",
      "1/4 cup all-purpose flour",
      "32 ounces low-sodium homemade or store-bought chicken stock",
      "1 pound Yukon gold potatoes, cut into bite-size pieces",
      "1/2 teaspoon freshly ground black pepper",
      "Chopped parsley, for garnish"
    ],
    "directions": [
      "In a large heavy-bottomed pot over medium-high heat, heat the oil.",
      "Sear the chicken for about 3 minutes on each side, until browned.",
      "Transfer to a cutting board and cut the chicken into bite-size pieces. Set aside.",
      "In the same pot over medium heat, cook the onion and garlic, stirring, for about 3 minutes, until translucent and softened; season with salt.",
      "Add the rosemary and thyme and cook, stirring occasionally, for about 2 minutes, until fragrant. Add the carrots and celery and cook, stirring occasionally, for about 8 minutes, until translucent.",
      "Add the flour and cook, stirring constantly, for about 3 minutes, until all of the vegetables are coated and the raw taste has cooked off. Slowly pour in the stock, stirring to break up any lumps of flour.",
      "Add the chicken, potatoes, and pepper and stir to combine. Bring to a boil, then reduce the heat to medium-low and simmer for about 20 minutes, until the chicken and potatoes are fully cooked and the liquid has slightly thickened. Taste and adjust the seasonings; discard the thyme and rosemary sprigs.",
      "Divide the soup among bowls. Garnish with the parsley."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/chicken-stew-with-potatoes-carrots-and-celery/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Creamy Tortellini Soup with Sausage",
    "ingredients": [
      "14 ounces fresh cheese tortellini",
      "1 pound mild Italian sausage, no casings",
      "1 red bell pepper, thinly sliced",
      "2 shallots, finely chopped",
      "4 garlic cloves, minced",
      "2 tablespoons tomato paste",
      "1 cup puréed tomatoes or crushed tomatoes",
      "4 cups chicken broth",
      "1 cup heavy cream",
      "1/3 cup grated Parmesan",
      "fresh thyme, for serving",
      "1 teaspoon each: dried oregano, dried sage, smoked paprika, black pepper",
      "1/4 teaspoon red pepper flakes, more for serving",
      "1/4 teaspoon ground nutmeg",
      "salt, to taste"
    ],
    "directions": [
      "Heat a large pot over medium. Add bell pepper, sauté for 5 minutes, stirring from time to time. Add onion and garlic, cook for 2 minutes.",
      "Add sausage and spices, break up the meat into small pieces with a wooden spoon, and cook until browned and no longer pink, 5 minutes. Pour in chicken broth and bring to a boil. Add tomato paste and puréed tomatoes, cook for 15 minutes.",
      "Add tortellini, cook for 2 minutes. Then pour in cream and add Parmesan. Stir to combine, simmer for 1 minute. Taste and adjust salt. Finish off with some extra red pepper flakes, black pepper and fresh thyme. Enjoy!"
    ],
    "url": "https://recipeswithoutblogs.netlify.app/creamy-tortellini-soup-with-sausage/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Coconut Lime Chicken Curry with Rice Noodles.",
    "ingredients": [
      "1/2 sweet onion, quartered",
      "2 stalks lemongrass, roughly chopped",
      "1 red fresno pepper, seeded",
      "1 inch piece fresh ginger, peeled",
      "2 cloves garlic, chopped",
      "2 tablespoons Thai red or green curry paste",
      "2 tablespoons peanut or sesame oil",
      "1 pound boneless chicken breasts, cut into bite size pieces",
      "2-3 cups Almond Breeze Unsweetened Original Almondmilk Coconutmilk Blend",
      "2 tablespoons fish sauce",
      "1 bunch broccoli, ends trimmed",
      "8 ounces rice noodles",
      "juice of 2 limes",
      "1/4 cup fresh cilantro, chopped",
      "1/4 cup fresh basil, chopped, plus more for serving",
      "2 persian cucumbers, sliced",
      "sprouts, shredded coconut, shredded carrots, for serving"
    ],
    "directions": [
      "In a blender or food processor, combine the onion, lemongrass, fresno pepper, ginger, garlic, and curry paste and pulse until a paste forms.",
      "Heat the oil in a large pot set over medium heat. When the oil shimmers, add the curry paste mixture and cook until fragrant, about 2-3 minutes. Stir in the chicken and cook another 2-3 minutes until browned.",
      "Pour in the Coconut Almondmilk. Add the fish sauce and broccoli. Bring the mix to a simmer over medium heat and then reduce the heat to medium low and simmer 20-25 minutes or until the chicken is cooked through and the sauce has thickened slightly.",
      "When the curry is done, remove from the heat and stir in the lime juice, cilantro and basil.",
      "To serve, divide the noodles among bowls and ladle the curry over top. Garnish with the cucumbers, fresh basil, sprouts, carrots, and lime. Enjoy!"
    ],
    "url": "https://recipeswithoutblogs.netlify.app/coconut-lime-chicken-curry-with-rice-noodles/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Creamy Beef and Shells - Damn Delicious",
    "ingredients": [],
    "directions": [
      "In a large pot of boiling salted water, cook pasta according to package instructions; drain well.",
      "Heat olive oil in a large skillet over medium high heat. Add ground beef and cook until browned, about 3-5 minutes, making sure to crumble the beef as it cooks; drain excess fat. Set aside.",
      "Add onion to the skillet, and cook, stirring frequently, until translucent, about 2-3 minutes. Stir in garlic and Italian seasoning until fragrant, about 1 minute.",
      "Whisk in flour until lightly browned, about 1 minute.",
      "Gradually whisk in beef stock and tomato sauce. Bring to a boil; reduce heat and simmer, stirring occasionally, until reduced and slightly thickened, about 6-8 minutes.",
      "Stir in pasta, beef and heavy cream until heated through, about 1-2 minutes; season with salt and pepper, to taste. Stir in cheese until melted, about 2 minutes.",
      "Serve immediately."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/creamy-beef-and-shells/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Creamy French Mustard Chicken - Cafe Delites",
    "ingredients": [
      "2 tablespoons butter,",
      "1 brown shallot, chopped,",
      "4 cloves garlic, minced,",
      "1 cup dry white wine, or chicken broth,",
      "1-2 tablespoons Dijon mustard*,",
      "3/4 cup chicken broth,",
      "1 teaspoon fresh chopped tarragon leaves,",
      "1 teaspoon dried thyme,",
      "1/2 teaspoon fresh chopped rosemary leaves,",
      "1/2 cup heavy cream, (thickened cream),",
      "Salt and cracked black pepper, to taste"
    ],
    "directions": [
      "Season chicken breasts with garlic powder, salt and pepper. Dredge in flour, shaking off the excess. Set aside.",
      "Heat the butter and olive oil in a large pan or skillet over medium-high heat",
      "When hot, fry chicken breasts until golden on each side and just cooked through, about 3-4 minutes each side, depending on the thickness of your chicken. Transfer to a warm plate.",
      "Heat the remaining 2 tablespoons of butter in the pan. Sauté shallots until soft, about 4 minutes, then add the garlic and cook until fragrant, about 1 minute.",
      "Add the wine to deglaze the pan, scraping up the browned bits from bottom of pan with the end of your wooden spoon. Simmer until reduced to half, about 4 minutes.",
      "Stir the Dijon mustard into the pan juices. Add the chicken broth and herbs. Bring to a boil, then reduce heat to medium. Stir in cream and let simmer until sauce starts to thicken, about 3 minutes.",
      "Add chicken back into the pan. Simmer gently until chicken is heated through and sauce has thickened, about 5 minutes. Taste test and adjust salt and pepper, if desired.,Serve chicken with sauce."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/creamy-french-mustard-chicken/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Creamy Garlic Chicken",
    "ingredients": [
      "2 large chicken breasts cut in half lengthwise",
      "Flour for dredging",
      "1 tablespoon olive oil",
      "2 tablespoons butter divided",
      "1 whole head garlic cloves peeled",
      "1/2 cup chicken broth or stock",
      "1/2 teaspoon lemon juice",
      "1/4 teaspoon garlic powder",
      "1 cup heavy/whipping cream",
      "Salt & pepper to taste"
    ],
    "directions": [
      "Cut the chicken in half lengthwise so you have 4 smaller cutlets. Sprinkle them with some salt & pepper and coat them in the flour.",
      "Add the olive oil and 1 tbsp of the butter to a skillet over medium-high heat. Once the pan is hot, sauté the chicken for 4-5 minutes/side or until it's nice and golden. Take the chicken out of the pan and set it aside.",
      "Reduce the heat to medium (or even med-low if using cast iron), and add the rest of the butter to the pan. Let it melt and then add the garlic cloves. Cook them for 3-4 minutes, stirring often, until they're lightly browned on the outside.",
      "Add the chicken broth, lemon juice, and garlic powder to the pan. Let it bubble for around 4 minutes or until the liquid is noticeably reduced.",
      "Stir in the cream and add the chicken back into the pan. Let it cook for another 5 minutes or so, until the sauce is reduced and the chicken is cooked through. Serve with freshly chopped parsley if you wish."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/creamy-garlic-chicken/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Creamy Tortellini Soup with Sausage",
    "ingredients": [
      "14 ounces fresh cheese tortellini",
      "1 pound mild Italian sausage, no casings",
      "1 red bell pepper, thinly sliced",
      "2 shallots, finely chopped",
      "4 garlic cloves, minced",
      "2 tablespoons tomato paste",
      "1 cup puréed tomatoes or crushed tomatoes",
      "4 cups chicken broth",
      "1 cup heavy cream",
      "1/3 cup grated Parmesan",
      "fresh thyme, for serving",
      "1 teaspoon each: dried oregano, dried sage, smoked paprika, black pepper",
      "1/4 teaspoon red pepper flakes, more for serving",
      "1/4 teaspoon ground nutmeg",
      "salt, to taste"
    ],
    "directions": [
      "Heat a large pot over medium. Add bell pepper, sauté for 5 minutes, stirring from time to time. Add onion and garlic, cook for 2 minutes.",
      "Add sausage and spices, break up the meat into small pieces with a wooden spoon, and cook until browned and no longer pink, 5 minutes. Pour in chicken broth and bring to a boil. Add tomato paste and puréed tomatoes, cook for 15 minutes.",
      "Add tortellini, cook for 2 minutes. Then pour in cream and add Parmesan. Stir to combine, simmer for 1 minute. Taste and adjust salt. Finish off with some extra red pepper flakes, black pepper and fresh thyme. Enjoy!"
    ],
    "url": "https://recipeswithoutblogs.netlify.app/creamy-tortellini-soup-with-sausage/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "crispy rice and egg bowl with ginger-scallion vinaigrette – smitten kitchen",
    "ingredients": [
      "1 1/4 cups minced scallions, both green and white parts (from a 4-ounce bundle),",
      "2 tablespoons minced or finely grated fresh ginger,",
      "Neutral oil (such as grapeseed, safflower, or sunflower),",
      "1/4 cup sherry or rice wine vinegar,",
      "Fine sea salt,",
      "About 1 heaped cup julienned or coarsely grated carrots (from about 8 ounces fresh)",
      "8 ounces small (Persian-style, about 2) cucumbers, thinly sliced,3 cups cooked, cooled rice (my favorite here is short-grain brown or white),",
      "4 eggs,Soy sauce or tamari (to serve),",
      "Toasted sesame oil (to serve),",
      "Sriracha, gochujang or another hot sauce of your choice (to serve)"
    ],
    "directions": [
      "Make the vinaigrette: Mix scallions, ginger, 1/4 cup oil and sherry or rice wine vinegar in a bowl. Season with salt (I use about 1/2 teaspoon fine sea salt). Set aside.",
      "Crisp your rice: Heat a large frying pan over medium high. Add 1 to 2 tablespoons oil; you’ll want to coat the bottom with a thin layer of oil all over. Nonstick pan (as I used) are more forgiving here, so you can use the lower amount. Heat the oil until it’s hot, another minute, then scatter half the rice over the surface; it’s okay if small clusters remain. Season lightly with salt and do not touch it. In 3 to 5 minutes, the underside will become golden brown and crisp. Use a spatula to flip it in sections then fry on the other side until it is also crisp. Divide between two bowls and repeat with remaining rice, dividing it between two remaining bowls.",
      "Crisp your egg: If there isn’t enough oil left in the pan (you want a thin layer), add another splash and heat this on high heat. Add eggs one at a time and season lightly with salt and pepper. Cook until brown, lacy, and crisp underneath, and the whites are opaque, bubbly and dramatic and the edges are brown. You can spoon some oil from the pan over the egg whites to help them cook faster. Place one egg on each bowl of rice.",
      "Assemble bowls: Arrange some cucumbers and carrots to each bowl. Spoon 2 tablespoons vinaigrette onto each bowls. Drizzle each egg with a half-teaspoon of tamari and toasted sesame oil, letting it roll onto the other ingredients, plus hot sauce to taste. Eat immediately. Repeat frequently."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/crispy-rice-and-egg-bowl-with-ginger-scallion-vinaigrette/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Crockpot Banh Mi Brown Rice Bowls with Asian Slaw",
    "ingredients": [
      "2 lbs pork shoulder, (or beef chuck roast, or chicken breast!)",
      "½ cup soy sauce",
      "½ cup low sodium beef stock",
      "1 tsp sesame oil",
      "2 tablespoons rice wine vinegar",
      "salt & pepper",
      "6 cloves garlic, peeled",
      "1 onion, peeled and quartered",
      "1/2 cup brown sugar",
      "Optional 1 tsp cayenne pepper, to taste",
      "1 bag coleslaw mix, (shredded cabbage and carrots)",
      "1/2 cup white vinegar",
      "1/4 cup white sugar",
      "1 tbsp salt",
      "1 tbsp mayonaise",
      "Sliced cucumbers",
      "Sliced jalapeños",
      "Fresh cilantro",
      "Cooked brown rice"
    ],
    "directions": [
      "Add all the meat ingredients, (first ten, through cayenne pepper) to a slow cooker. Cook on low for 8 hours or on high for 4. Shred meat with two forks, and let sit in the juices on warm until ready to serve.",
      "Meanwhile, make the slaw: in a tupperware container or large mason jar, mix up the vinegar, white sugar, salt, and mayo. Add 2 cups of the coleslaw mix, and coat with the liquid. Cover and let sit at least an hour in the fridge. As you use the slaw, you can add more of the coleslaw mix from the bag to the remaining liquid.",
      "To assemble the bowls, heat brown rice, and top with a generous portion of the shredded meat. Top with lots of coleslaw and sliced cucumbers, jalapeños, and cilantro."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/crockpot-banh-mi-rice-bowl/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Garlic Butter Steak Bites",
    "ingredients": [
      "2 pounds beef strip steak (1-inch thick), cut into 1-inch pieces",
      "2 teaspoons kosher salt, divided",
      "1 teaspoon black pepper, divided",
      "2 tablespoons vegetable oil",
      "5 medium garlic cloves, finely chopped (3 tablespoons)",
      "1/3 cup dry vermouth",
      "4 tablespoons unsalted butter, cubed",
      "2 teaspoons Worcestershire sauce",
      "1 tablespoon finely chopped fresh flat-leaf parsley"
    ],
    "directions": [
      "Heat a large cast-iron skillet over medium-high. Sprinkle steak all over with 1 1/2 teaspoons of the salt and 1/2 teaspoon of the pepper. Add oil to skillet, and heat until shimmering. Add half of the steak pieces to skillet, keeping space between each piece. Cook, undisturbed, until browned and crispy on bottoms, about 1 minute. Flip steak pieces, and continue cooking until browned on other side, about 1 minute. Flip pieces again, and cook, turning occasionally, until most sides are browned and crispy and steak is almost medium-rare, 1 to 2 minutes. Transfer steak to a large bowl. Repeat cooking process with remaining steak pieces, transferring cooked steak to bowl with first batch; set aside. Do not wipe skillet clean.",
      "Reduce heat under skillet to medium; add garlic, and cook, stirring constantly, until golden brown, about 30 seconds. Add vermouth, and scrape up browned bits from bottom of skillet. Cook, stirring occasionally, until liquid is reduced to about 3 tablespoons, about 1 minute. Remove from heat; add butter, and stir until melted and creamy. Add Worcestershire sauce and remaining 1/2 teaspoon each salt and pepper. Pour mixture over steak pieces in bowl, and toss to coat. Transfer steak with butter sauce to a platter, and sprinkle with parsley. Serve immediately."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/garlic-butter-steak-bites/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Gruyere and Cheddar Soup",
    "ingredients": [
      "1 tablespoon extra-virgin olive oil",
      "1 cup grated peeled carrots",
      "1/2 large yellow onion, diced",
      "Sea salt and freshly ground black pepper",
      "2 garlic cloves, minced",
      "2 cups unsalted chicken broth",
      "1/4 cup dry white wine",
      "1 1/4 cups freshly grated Gruyère",
      "1/2 cup freshly grated sharp cheddar",
      "1 tablespoon all-purpose flour",
      "Freshly chopped parsley leaves and thinly sliced scallions, for serving",
      "Toasted focaccia, for serving"
    ],
    "directions": [
      "Heat the olive oil in a medium saucepan over medium-high heat.",
      "Add the carrots and onion and cook, stirring occasionally, for 3 to 4 minutes, until softened. Season with salt and pepper. Add the garlic and cook for another minute until fragrant.",
      "Stir in the chicken broth and white wine, then bring to a simmer on medium heat, about 4 to 5 minutes.",
      "In a medium bowl, combine the cheeses with the flour, evenly coating the cheese.",
      "Whisk the cheese into the soup in batches, making sure the cheese does not clump and is fully melted. Whisk for about 2 minutes, until the soup reaches a smooth consistency. Taste and adjust the seasoning with salt and pepper.",
      "Ladle the soup into serving bowls. Top with parsley and scallions, then serve immediately with toasted focaccia."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/gruyere-and-cheddar-soup/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Guy Fieri Garlic Bread",
    "ingredients": [
      "2 sticks butter, softened",
      "2 cloves garlic, minced",
      "1 scallion, minced",
      "1 tablespoon Parmesan",
      "1 tablespoon finely chopped parsley leaves",
      "Hot sauce, to taste",
      "Salt and freshly cracked black pepper",
      "1 French baguette"
    ],
    "directions": [
      "In a small bowl, mix butter together with garlic, scallion, Parmesan, parsley, hot sauce and salt and pepper, to taste.",
      "Preheat broiler with rack 4 inches from heat.",
      "Slice baguette horizontally.",
      "Spread butter on both halves.",
      "Place on a sheet pan and toast under the broiler, about 2 minutes."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/guy-fieri-garlic-bread/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Ham for Two",
    "ingredients": [
      "2 3/4 cups water",
      "1/3 cup packed dark brown sugar",
      "1/4 cup kosher salt",
      "1 teaspoon curing salt",
      "1 pork tenderloin, trimmed",
      "1/2 cup maple syrup",
      "1 1/2 teaspoons black pepper",
      "Place water, sugar, and salts in a saucepan over high heat stirring until sugar dissolves, 4 to 5 minutes. Let cool to room temperature.",
      "Place pork in a nonreactive bowl or glass baking dish. Pour brine over pork. Refrigerate 24 hours.",
      "Preheat oven to 400°.",
      "Place pork on a rack in a roasting pan. Roast at 400° on the middle rack of oven for 10 minutes. Combine syrup and pepper; brush pork with maple mixture. Continue cooking pork until a thermometer inserted into the pork registers 130°, about 15 to 18 minutes, brushing with maple mixture every 5 minutes. Turn broiler to low. Continue cooking pork until a thermometer inserted into the pork registers 140° and pork is pinkish brown and caramelized, about 5 to 7 minutes. Remove from oven. Let stand 10 minutes. Slice and serve with remaining glaze."
    ],
    "directions": [],
    "url": "https://recipeswithoutblogs.netlify.app/ham-for-two/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Honey Sriracha Chicken Recipe – Slow Cooker",
    "ingredients": [
      "2 lbs chicken breast 4-5 breasts",
      "1 onion chopped",
      "1/2 cup Sriracha or any chili garlic hot sauce",
      "1/4 cup honey",
      "2 tablespoons lime juice"
    ],
    "directions": [
      "Place the chicken breasts and chopped onion in a slow cooker.",
      "In a small bowl stir together Sriracha sauce, honey and lime juice. Add to the slow cooker and toss the chicken to coat it evenly with sauce.",
      "Cook for 3-4 hours on high (or 6-8 hours on low).",
      "Lift the chicken breasts from the slow cooker and shred with 2 forks. Add in as much of the cooking sauce as desired (I like it saucy and will often use all of it)."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/honey-sriracha-chicken-slow-cooker/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  },
  {
    "title": "Italian Sausage and Penne",
    "ingredients": [
      "3 tablespoons extra-virgin olive oil (1.5oz, 42g)",
      "1 small onion, chopped fine",
      "3 cloves garlic, chopped fine or put through the garlic press",
      "1 lb sweet Italian sausage (454g) see note",
      "1 teaspoon Italian seasoning (or a mix of dried basil, thyme, marjoram, and oregano)",
      "1 bay leaf",
      "1 cup chicken broth (8.3oz, 235g)",
      "1 1/2 cups heavy cream (12.6oz, 357g)",
      "3/4 cup freshly grated Parmesan cheese (2.6oz, 74g)",
      "handful of fresh basil, sliced thin",
      "salt and pepper to taste",
      "1 lb penne pasta (454g)",
      "1 tablespoon butter (.5oz, 14g)"
    ],
    "directions": [
      "Bring a large pan of salted water to a boil. Add the penne and cook until al dente. Drain and toss with butter.",
      "Heat the oil in a skillet over medium heat and sauté the onion and garlic until it is soft and translucent.",
      "Remove the sausage from casings and add to the pan. Cook until browned.",
      "Add Italian seasoning, bay leaf, chicken broth, and heavy cream. Let simmer on low for 15 minutes.",
      "Off the heat, stir in parmesan cheese, fresh basil, and salt and pepper to taste.",
      "Toss with hot buttered penne and serve immediately."
    ],
    "url": "https://recipeswithoutblogs.netlify.app/italian-sausage-and-penne/",
    "uid": "JMe2HfuzV1hlfcSznUPKhPBMswk1"
  }
]
